# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 11 # number of classes
scale: n
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
  - [-1, 1, MV2Block, [32, 1, 4]]  # 1
  - [-1, 1, MV2Block, [48, 2, 4]]  # 2-P2/4
  - [-1, 1, MV2Block, [48, 1, 4]]  # 3
  - [-1, 1, MV2Block, [48, 1, 4]]  # 4
  - [-1, 1, MV2Block, [64, 2, 4]]  # 5-P3/8
  - [-1, 1, MobileViTBlock, [96, 2, 64, 3, 2, 192, 0]]  # 6 (输入通道64)
  - [-1, 1, MV2Block, [80, 2, 4]]  # 7-P4/16
  - [-1, 1, MobileViTBlock, [120, 4, 80, 3, 2, 240, 0]]  # 8 (输入通道80)
  - [-1, 1, MV2Block, [96, 2, 4]]  # 9-P5/32
  - [-1, 1, MobileViTBlock, [144, 3, 96, 3, 2, 288, 0]]  # 10 (输入通道96)
  
# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4 (output of MobileViTBlock at index 8)
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3 (output of MobileViTBlock at index 6)
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5 (output of MobileViTBlock at index 10)
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)